Hey！您的博客上线了！ Bat 是一个简易的博客系统，兼容ie8+、chrome、firefox以及手机移动端等平台，具有在线编辑、图片上传、评论、后台管理等基本功能。下面为您介绍一些主要功能的使用。

---

## 在线编辑
成功登陆系统后，点击顶部栏右上角的 + 可以快速进入文章编辑页面。编辑页面有两个区域，左边是编辑区，右边是预览区，在编辑文章时可以实时预览内容。Bat 有两种编辑模式，`Markdown` 和 `文本模式`。Markdown 是一种轻量级的标记语言，使用Markdown可以快速写出美观的文章。当然您也可以使用文本模式，这时候编辑器就跟普通的记事本一样啦。（这篇文章就是使用Markdown写的哦）

成功登陆系统后，在浏览文章时，你可以通过点击标题上面的<span style='background:cornflowerblue'>&nbsp;&nbsp;&nbsp;&nbsp;</span>按钮，对文章进行相应操作：置顶、编辑、删除。

文章支持标签分类，这样您的文章就更加‘井然有序’啦。

## 图片上传
在Markdown模式中您可以插入图片，插入的图片将根据您的**上传策略**存储到第三方服务器或者本地服务器。您也可以直接**拖动图片到编辑区域**，快速插入图片。

关于上传策略，默认为上传到本地服务器，建议您选择`上传到第三方（七牛）`，新建文章的时候插入的图片会上传到第三方服务器，这样可以大大提高上传速度以及减轻服务器的压力。选择`上传到第三方（七牛）`所需填写的信息均可在注册[七牛](http://www.qiniu.com)后在账号设置里获取。

## 后台管理
 通过 <a href='/bat' target='_blank'><span id='bat'></span></a> 链接就可以登录系统后台，管理您的的博客。您也可以通过**双击**首页左上角的&nbsp;![img](/public/img/logo.png "=20x20")&nbsp;快速登录系统后台。当您进入后台管理，可以进行如下操作
+ 修改博客信息
+ 修改上传策略
+ 导出数据库
+ 管理标签
+ 管理评论

----
好的，介绍就到这里了，还有更多惊喜等待您去发现 >> **[开始 Bat 博客之旅吧！](/bat)**

<script>
 $('#bat').text(location.protocol+'//'+location.host+'/bat');
</script>